# 0. Вывести квадрат числа

def SquareNum(value):
    return value ** 2

print('Введите число')
number = float(input())
print(SquareNum(number))